In [2]:
x = ['Apple',1,5,6]
import pandas as pd
x_ser = pd.Series(x)
x_ser
#this is panda serires

0    Apple
1        1
2        5
3        6
dtype: object

x = ['Apple',1,5,6]
import numpy as np
x_arr = np.array(x)
x_arr
#this is numpy

In [4]:
x = ["Apple",1,5.7]
x_index = ['Fruit','Number','Float']
import pandas as pd
x_ser = pd.Series(data = x,index =x_index)
x_ser

Fruit     Apple
Number        1
Float       5.7
dtype: object

In [5]:
month_2022 = ['Jan','Feb','March','April']
earning = [1.2,4.6,2.1,6.7]
earning_2022 = pd.Series(data = earning, index = month_2022)
earning_2022

Jan      1.2
Feb      4.6
March    2.1
April    6.7
dtype: float64

In [11]:
month_2023 = ['Jan','March','April']
earning = [1.2,2.1,6.7]
earning_2023 = pd.Series(data = earning, index = month_2023)
earning_2023

Jan      1.2
March    2.1
April    6.7
dtype: float64

In [12]:
tot_earning = earning_2022 + earning_2023
tot_earning

April    13.4
Feb       NaN
Jan       2.4
March     4.2
dtype: float64

In [13]:
tot_earning_new = earning_2022.add(earning_2023,fill_value = 0)
tot_earning_new

April    13.4
Feb       4.6
Jan       2.4
March     4.2
dtype: float64

In [14]:
malhar_inc = {'Emp_name':['mike','jake','peter'],'salary':[15000,5000,6000],'car':['bugatti','ferrari','yd']}

In [16]:
malhar_inc_arr = pd.DataFrame(malhar_inc)
malhar_inc_arr

  Emp_name  salary      car
0     mike   15000  bugatti
1     jake    5000  ferrari
2    peter    6000       yd

In [21]:
st_per = pd.read_csv('C:/student.csv')
st_per

,Student_ID,First_Name,Last_Name,Email,Gender,Age,Department,Attendance (%),Midterm_Score,Final_Score,...,Projects_Score,Total_Score,Grade,Study_Hours_per_Week,Extracurricular_Activities,Internet_Access_at_Home,Parent_Education_Level,Family_Income_Level,Stress_Level (1-10),Sleep_Hours_per_Night
0,S1000,Omar,Williams,student0@university.com,Female,22,Mathematics,97.36,40.61,59.61,...,62.84,59.8865,F,10.3,Yes,No,Master's,Medium,1,5.9
1,S1001,Maria,Brown,student1@university.com,Male,18,Business,97.71,57.27,74.00,...,98.23,81.9170,B,27.1,No,No,High School,Low,4,4.3
2,S1002,Ahmed,Jones,student2@university.com,Male,24,Engineering,99.52,41.84,63.85,...,91.22,67.7170,D,12.4,Yes,No,High School,Low,9,6.1
3,S1003,Omar,Williams,student3@university.com,Female,24,Engineering,90.38,45.65,44.44,...,55.48,51.6535,F,25.5,No,Yes,High School,Low,8,4.9
4,S1004,John,Smith,student4@university.com,Female,23,CS,59.41,53.13,61.77,...,87.43,71.4030,C,13.3,Yes,No,Master's,Medium,6,4.5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4995,S5995,Ahmed,Jones,student4995@university.com,Male,19,CS,96.09,45.86,45.63,...,51.66,53.5470,F,7.8,No,No,Master's,Medium,10,4.5
4996,S5996,Emma,Brown,student4996@university.com,Male,19,Mathematics,96.30,78.67,47.42,...,52.33,59.0240,F,24.2,No,Yes,NaN,Medium,4,7.2
4997,S5997,John,Brown,student4997@university.com,Female,24,CS,89.94,50.84,65.83,...,97.89,74.7560,C,7.6,No,Yes,NaN,High,5,6.6
4998,S5998,Sara,Davis,student4998@university.com,Male,23,Engineering,99.09,55.44,57.45,...,84.74,68.6585,D,14.5,Yes,No,PhD,Medium,10,5.9
4999,S5999,Maria,Brown,student4999@university.com,Female,21,Mathematics,90.33,93.29,88.42,...,66.23,78.7485,C,29.9,Yes,Yes,PhD,High,2,5.3

In [22]:
st_per.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5000 entries, 0 to 4999
Data columns (total 23 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Student_ID                  5000 non-null   object
 1   First_Name                  5000 non-null   object
 2   Last_Name                   5000 non-null   object
 3   Email                       5000 non-null   object
 4   Gender                      5000 non-null   object
 5   Age                         5000 non-null   int64
 6   Department                  5000 non-null   object
 7   Attendance (%)              5000 non-null   float64
 8   Midterm_Score               5000 non-null   float64
 9   Final_Score                 5000 non-null   float64
 10  Assignments_Avg             5000 non-null   float64
 11  Quizzes_Avg                 5000 non-null   float64
 12  Participation_Score         5000 non-null   float64
 13  Projects_Score              5000 non-null   float64
 14  Total_Score                 5000 non-null   float64
 15  Grade                       5000 non-null   object
 16  Study_Hours_per_Week        5000 non-null   float64
 17  Extracurricular_Activities  5000 non-null   object
 18  Internet_Access_at_Home     5000 non-null   object
 19  Parent_Education_Level      3975 non-null   object
 20  Family_Income_Level         5000 non-null   object
 21  Stress_Level (1-10)         5000 non-null   int64
 22  Sleep_Hours_per_Night       5000 non-null   float64
dtypes: float64(10), int64(2), object(11)
memory usage: 898.6+ KB

In [23]:
st_per.describe()

,Age,Attendance (%),Midterm_Score,Final_Score,Assignments_Avg,Quizzes_Avg,Participation_Score,Projects_Score,Total_Score,Study_Hours_per_Week,Stress_Level (1-10),Sleep_Hours_per_Night
count,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5000.00000,5000.000000,5000.000000,5000.000000,5000.000000
mean,21.048400,75.356076,70.701924,69.546552,74.956320,74.836214,49.963720,74.78305,71.652097,17.521140,5.507200,6.514420
std,1.989786,14.392716,17.436325,17.108996,14.404287,14.423848,28.989785,14.54243,7.230097,7.193035,2.886662,1.446155
min,18.000000,50.010000,40.000000,40.010000,50.000000,50.000000,0.000000,50.00000,50.602000,5.000000,1.000000,4.000000
25%,19.000000,62.945000,55.707500,54.697500,62.340000,62.357500,25.075000,61.97000,66.533875,11.500000,3.000000,5.300000
50%,21.000000,75.670000,70.860000,69.485000,75.090000,74.905000,49.600000,74.54000,71.696250,17.400000,6.000000,6.500000
75%,23.000000,87.862500,85.760000,83.922500,87.352500,87.292500,75.500000,87.63000,76.711625,23.700000,8.000000,7.800000
max,24.000000,100.000000,99.990000,99.980000,99.990000,99.990000,100.000000,100.00000,95.091500,30.000000,10.000000,9.000000

In [24]:
st_per

,Student_ID,First_Name,Last_Name,Email,Gender,Age,Department,Attendance (%),Midterm_Score,Final_Score,...,Projects_Score,Total_Score,Grade,Study_Hours_per_Week,Extracurricular_Activities,Internet_Access_at_Home,Parent_Education_Level,Family_Income_Level,Stress_Level (1-10),Sleep_Hours_per_Night
0,S1000,Omar,Williams,student0@university.com,Female,22,Mathematics,97.36,40.61,59.61,...,62.84,59.8865,F,10.3,Yes,No,Master's,Medium,1,5.9
1,S1001,Maria,Brown,student1@university.com,Male,18,Business,97.71,57.27,74.00,...,98.23,81.9170,B,27.1,No,No,High School,Low,4,4.3
2,S1002,Ahmed,Jones,student2@university.com,Male,24,Engineering,99.52,41.84,63.85,...,91.22,67.7170,D,12.4,Yes,No,High School,Low,9,6.1
3,S1003,Omar,Williams,student3@university.com,Female,24,Engineering,90.38,45.65,44.44,...,55.48,51.6535,F,25.5,No,Yes,High School,Low,8,4.9
4,S1004,John,Smith,student4@university.com,Female,23,CS,59.41,53.13,61.77,...,87.43,71.4030,C,13.3,Yes,No,Master's,Medium,6,4.5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4995,S5995,Ahmed,Jones,student4995@university.com,Male,19,CS,96.09,45.86,45.63,...,51.66,53.5470,F,7.8,No,No,Master's,Medium,10,4.5
4996,S5996,Emma,Brown,student4996@university.com,Male,19,Mathematics,96.30,78.67,47.42,...,52.33,59.0240,F,24.2,No,Yes,NaN,Medium,4,7.2
4997,S5997,John,Brown,student4997@university.com,Female,24,CS,89.94,50.84,65.83,...,97.89,74.7560,C,7.6,No,Yes,NaN,High,5,6.6
4998,S5998,Sara,Davis,student4998@university.com,Male,23,Engineering,99.09,55.44,57.45,...,84.74,68.6585,D,14.5,Yes,No,PhD,Medium,10,5.9
4999,S5999,Maria,Brown,student4999@university.com,Female,21,Mathematics,90.33,93.29,88.42,...,66.23,78.7485,C,29.9,Yes,Yes,PhD,High,2,5.3

In [25]:
st_per[['Gender','Age']]

      Gender  Age
0     Female   22
1       Male   18
2       Male   24
3     Female   24
4     Female   23
...      ...  ...
4995    Male   19
4996    Male   19
4997  Female   24
4998    Male   23
4999  Female   21

[5000 rows x 2 columns]

In [26]:
st_per.iloc[:,[0,3]]
#if you want entire column use ':' this

     Student_ID                       Email
0         S1000     student0@university.com
1         S1001     student1@university.com
2         S1002     student2@university.com
3         S1003     student3@university.com
4         S1004     student4@university.com
...         ...                         ...
4995      S5995  student4995@university.com
4996      S5996  student4996@university.com
4997      S5997  student4997@university.com
4998      S5998  student4998@university.com
4999      S5999  student4999@university.com

[5000 rows x 2 columns]

In [39]:
Gender = st_per.iloc[:,0]
Gender

0       S1000
1       S1001
2       S1002
3       S1003
4       S1004
        ...
4995    S5995
4996    S5996
4997    S5997
4998    S5998
4999    S5999
Name: Student_ID, Length: 5000, dtype: object

In [37]:
f = 0
m = 0
mal = st_per['Gender']
for i in mal:
    if(i=='Female'):
        f+=1
    else:
        m+=1
print('males',m)
print('females',f)
#m = st_per['Gender'] ye likha kyu ki ye variable nahi tha m variable hai

males 2551
females 2449

In [38]:
mal.value_counts()

Gender
Male      2551
Female    2449
Name: count, dtype: int64

In [41]:
mal.unique()

array(['Female', 'Male'], dtype=object)